Repository: vunguyen-dmt/ubcpi
Catalog: ubcpi/translations/*/LC_MESSAGES/text.po
Languages: vi

source: "Simple" means examples for different answer possibilities are intentionally selected when students are viewing peer answers.<br>"Random" means examples are selected at random and may not include different answer possibilities.
vi: "Đơn giản" nghĩa là các ví dụ cho các khả năng trả lời khác nhau được chọn một cách có chủ ý khi người học xem các câu trả lời của bạn học.<br>"Ngẫu nhiên" nghĩa là các ví dụ được chọn ngẫu nhiên và có thể không bao gồm các khả năng trả lời khác nhau.

source: (You chose this option)
vi: (Bạn chọn tùy chọn này)

source: (including you)
vi: (bao gồm bạn)

source: ({{weight}} point possible)
vi: ({{weight}} điểm)

source: ({{weight}} points possible)
vi: ({{weight}} điểm)

source: , Completed
vi: , đã hoàn thành

source: , In Progress
vi: , Đang thực hiện

source: , Upcoming
vi: , Sắp tới

source: Add Image To Question
vi: Thêm hình ảnh cho câu hỏi

source: Add New Answer
vi: Thêm câu trả lời mới

source: Add New Example
vi: Thêm ví dụ mới

source: Add example answers to the answer pool for this question. Students most likely to see these answers are those completing the assignment first, when the answer pool is small.
vi: Thêm các câu trả lời mẫu cho câu hỏi này. Những người học trả lời sớm thường sẽ thấy các câu trả lời mẫu này, khi số lượng câu trả lời ít.

source: Add the text for this answer. If you wish to add an image, press the button below.
vi: Thêm văn bản cho câu trả lời này. Nếu bạn muốn thêm một hình ảnh, hãy nhấn nút bên dưới.

source: Alternative text - a description of the image for non-visual users. The description should provide all the information needed for someone to answer the question if the image did not load.
vi: Văn bản thay thế - mô tả hình ảnh cho người dùng không tải được ảnh. Mô tả phải cung cấp tất cả thông tin cần thiết để ai đó trả lời câu hỏi nếu hình ảnh không tải.

source: Answer
vi: Câu trả lời

source: Answer {{$index + 1}}
vi: Câu trả lời {{$index + 1}}

source: Answers Students See - Number Selected <font color="red">*</font>
vi: Các câu trả lời người học thấy - Số lượng chọn <font color="red">*</font>

source: Answers Students See - Selection Logic <font color="red">*</font>
vi: Các câu trả lời người học thấy - Lựa chọn Logic <font color="red">*</font>

source: Cancel
vi: Hủy

source: Choose if you want the image to appear above or below the question text.
vi: Chọn nếu bạn muốn hình hảnh xuất hiện bên trên hoặc bên dưới câu hỏi.

source: Choose if you want the image to appear above or below the question.
vi: Chọn nếu bạn muốn hình ảnh xuất hiện bên trên hoặc bên dưới câu hỏi.

source: Choose the answer you consider correct, or select "n/a" if there is no correct answer.
vi: Chọn câu trả lời bạn cho là đúng, hoặc chọn "n/a" nếu không có câu trả lời đúng.

source: Choose the answer.
vi: Chọn câu trả lời

source: Chose after revision
vi: Lựa chọn sau khi sửa đổi

source: Chose initially
vi: Lựa chọn ban đầu

source: Correct Answer <font color="red">*</font>
vi: Câu trả lời đúng <font color="red">*</font>

source: Correct Answer:
vi: Câu trả lời đúng:

source: Correct Option
vi: Lựa chọn đúng

source: Defines the number of points each problem is worth. If the value is not set, the problem is worth the sum of the option point values.
vi: Xác định điểm mỗi câu hỏi. Nếu giá trị không được đặt, câu hỏi sẽ có điểm bằng tổng điểm các lựa chọn.

source: Display Name <font color="red">*</font>
vi: Tên hiển thị <font color="red">*</font>

source: Error refreshing answers from other students
vi: Lỗi khi làm mới câu trả lời từ các người học khác

source: Error retrieving data!
vi: Lỗi truy vấn dữ liệu!

source: Error retrieving statistics!
vi: Lỗi truy vấn thống kê!

source: Error saving question
vi: Lỗi lưu câu hỏi

source: Error submitting answer!
vi: Lỗi nộp câu trả lời!

source: Example Answer {{$index + 1}}
vi: Câu trả lời mẫu {{$index + 1}}

source: Example Answers <font color="red">*</font>
vi: Các câu trả lời mẫu <font color="red">*</font>

source: Explain to other students why you chose this answer (required):
vi: Giải thích với các bạn học khác tại sao bạn lại chọ câu trả lời này (bắt buộc):

source: Explanation
vi: Giải thích

source: Explanation (optional)
vi: Giải thích (không bắt buộc)

source: Explanation <font color="red">*</font>
vi: Giải thích <font color="red">*</font>

source: First, the learner answers a multiple choice question and provides an explanation for the answer. Next, the learner sees answers and explanations submitted by other learners. After reflecting on these peer responses, the learner can make revisions and submit a final answer and explanation. Finally, the learner sees the correct answer, if supplied, and any explanation that you provided for it.
vi: Trước tiên, người học trả lời một câu hỏi nhiều lựa chọn và cung cấp một giải thích cho câu trả lời. Tiếp theo, người học sẽ thấy câu trả lời và giải thích được nộp bởi những người học khác. Sau đó đối chiếu các câu trả lời từ bạn học, người học có thể sửa lại câu trả lời và nộp câu trả lời cuối cùng với giải thích. Cuối cùng, người học sẽ thấy câu trả lời đúng, nếu được cung cấp, và giải thích mà bạn cung cấp.

source: In the next step, you will be shown a selection of other responses that may help you refine your answer.
vi: Trong bước tiếp theo, bạn sẽ thấy các lựa chọn của bạn học khác, điều này có thể giúp bạn cải thiện câu trả lời của mình.

source: Maximum Characters <font color="red">*</font>
vi: Số ký tự tối đa <font color="red">*</font>

source: Minimum Characters <font color="red">*</font>
vi: Số ký tự tối thiểu <font color="red">*</font>

source: Next Step
vi: Bước tiếp theo

source: Not enough data to generate the chart. Please check back later.
vi: Không đủ dữ liệu để tạo biểu đồ. Vui lòng xem lại sau.

source: Note:
vi: Lưu ý:

source: Option {{ $index + 1 }}
vi: Lựa chọn {{ $index + 1 }}

source: Peer Instruction
vi: Hướng dẫn đồng đẳng

source: Peer instruction problems give learners more interactive engagement while they complete a multiple choice question that may or may not have a correct answer. The tool supports deeper consideration of the learner’s understanding of a concept and the correctness (if applicable) of an initial answer. Learners complete these problems in three steps.
vi: Các câu hỏi Hướng dẫn đồng đẳng (Peer instruction) giúp người học tương tác nhiều hơn khi họ làm câu hỏi nhiều lựa chọn (Multiple choice) có thể có câu trả lời đúng hoặc không. Công cụ này hỗ trợ xem xét sâu hơn về sự hiểu biết của người học về khái niệm và tính đúng đắn (nếu có) của câu trả lời bạn đầu. Người học hoàn thành câu hỏi này với ba bước.

source: Please refresh the page and try again!
vi: Vui lòng tải lại trang và thử lại!

source: Possible Answers <font color="red">*</font>
vi: Các câu trả lời <font color="red">*</font>

source: Problem Weight
vi: Trọng số câu hỏi

source: Provide alternative text - a description of the image for non-visual users. The description should provide all the information needed for someone to answer the question if the image did not load.
vi: Cung cấp văn bản thay thế - một mô tả về hình ảnh cho người dùng không thể tải ảnh. Mô tả nên cung cấp tất cả thông tin cần thiết để người học trả lời nếu họ không tải được ảnh.

source: Provide an explanation for this answer.
vi: Cung cấp một giải thích cho câu trả lời này.

source: Question
vi: Câu hỏi

source: Question Text <font color="red">*</font>
vi: Nội dung câu hỏi <font color="red">*</font>

source: Reflection
vi: Tham khảo

source: Refreshing...
vi: Đang tải lại...

source: Remove
vi: Xóa

source: Remove Image
vi: Xóa ảnh

source: Results
vi: Kết quả

source: Revise Answer
vi: Sửa câu trả lời

source: Save
vi: Lưu

source: Saving
vi: Đang lưu

source: Show other samples
vi: Hiển thị các mẫu khác

source: Step 1) Give Initial Answer <span class="inline-hint">You can change this answer later, if you change your mind.</span>
vi: Bước 1) Cho câu trả lời ban đầu <span class="inline-hint">Bạn có thể thay đổi câu trả lời này nếu bạn đổi ý.</span>

source: Step 2) Read Other Student Answers <p class="ubcpi-other-answers-instructions" translate="">These are randomly chosen samples of other student answers for this question. Read them and compare with your answer below. Then you may revise your answer, if you wish.</p>
vi: Bước 2) Đọc câu trả lời của những người học khác <p class="ubcpi-other-answers-instructions" translate="">Đây là các câu trả lời được chọn ngẫu nhiên từ những người học khác . Hãy xem và so sánh với câu trả lời của bạn. Sau đó bạn có thể sửa lại câu trả lời của mình nếu bạn muốn.</p>

source: Step 3) View Course-Wide Results
vi: Bước 3) Xem kết quả toàn khóa học

source: Student Rationale
vi: Cơ sở lý luận của người học

source: Students see the explanation after seeing the final answer.
vi: Người học xem giải thích sau khi xem câu trả lời cuối cùng.

source: Submit Answer
vi: Nộp câu trả lời

source: Submitting
vi: Đang nộp

source: The answers appear as choices underneath the question, with a maximum of 10 allowed per question. Each answer may contain text, an image, or a combination of both. <br><br>To add another answer press the "Add New Answer" button. To remove an answer press the blue "x" next to the blue option you want to remove.
vi: Các câu trả lời xuất hiện dưới dạng lựa chọn bên dưới câu hỏi, với tối đa 10 lựa chọn mỗi câu hỏi. Mỗi câu trả lời có thể bao gồm văn bản, hình ảnh, hoăc kết hợp cả hai. <br><br>Để thêm một câu trả lời khác, nhấn nút "Thêm câu trả lời mới". Để xóa một câu trả lời, nhấp nút "x" màu xanh bên cạnh lựa chọn màu xanh mà bạn muốn xóa.

source: The question appears above the possible answers that you set below. You can use text, an image, or a combination of both. If you wish to add an image to your question, press the "Add Image To Question" button.
vi: Câu hỏi xuất hiện bên trên các câu trả lời mà bạn cài đặt bên dưới. Bạn có thể sử dụng văn bản, hình ảnh hoặc kết hợp cả hai. Nếu bạn muốn thêm một hình ảnh vào câu hỏi, nhấn nút "Thêm hình ảnh vào câu hỏi".

source: These are randomly chosen samples of other student answers for this question. Read them and compare with your answer below. Then you may revise your answer, if you wish.
vi: Đây là các câu trả lời được lựa chọn một cách ngẫu nhiên từ những người học khác. Hãy xem và so sanh với câu trả lời của bạn. Sau đó bạn có thể sửa câu trả lời của mình nếu muốn.

source: This is a look at how your classmates answered the question initially and after revision.
vi: Đây là cách các bạn cùng lớp trả lời câu hỏi ban đầu và sau khi sửa.

source: This is the maximum number of characters the student explanations may contain.
vi: Đây là số ký tự tối đa mà giải thích của người học có thể chứa.

source: This is the minimum number of characters the student explanations must contain.
vi: Đây là số ký tự tối thiểu mà giải thích của người học phải có.

source: This is the number of examples shown on screen to the students after they answer. Students can choose to refresh for some other samples. Enter the # symbol to use the same number as the answer possibilities you've set.
vi: Đây là số lượng câu trả lời mà người học có thể xem sau khi trả lời. Người học có thể chọn làm mới dữ liệu (refresh) để xem các câu trả lời khác. Nhập # để sử dụng cùng số với số câu trả lời bạn đã cài đặt.

source: This name appears in the horizontal navigation at the top of the page.
vi: Tên này xuất hiện ở thanh điều hướng ngang ở đầu trang.

source: Upload a file first by clicking Content, then Files and Uploads. Then copy the Studio URL. Paste that into the text field here.
vi: Dán đường dẫn tập tin tải lên vào đây.

source: View Question Statistics
vi: Xem thống kê câu hỏi

source: Warning
vi: Cảnh báo

source: What would you like to do?
vi: Bạn muốn làm gì?

source: You are approaching the limit of {{rationale_size.max}} characters for this answer. Characters left: {{rationale_size.max - rc.rationale.length}}
vi: Bạn sắp đạt đến giới hạn {{rationale_size.max}} ký tự cho câu trả lời này. Số ký tự còn lại: {{rationale_size.max - rc.rationale.length}}

source: You are unable to save this form as there are errors:
vi: Bạn không thể lưu mẫu này do có lỗi:

source: You:
vi: Bạn:

source: Your explanation must be at least {{rationale_size.min}} characters long. Please explain further.
vi: Giải thích của bạn phải có ít nhất {{rationale_size.min}} ký tự. Vui lòng nhập thêm.

source: Your explanation must contain fewer than {{rationale_size.max}} characters. Please trim the text.
vi: Giải thích của bạn phải ít hơn {{rationale_size.max}} ký tự. Vui lòng nhập ngắn hơn.

source: Your final explanation:
vi: Giải thích cuối cùng của bạn:

source: Option
vi: Lựa chọn

source: Missing option seed(s):
vi: Thiếu lựa chọn:

source: Missing 1 option seed
vi: Thiếu 1 lựa chọn

source: Question must have text element.
vi: Câu hỏi phải có văn bản.

source: Missing options elements in XML definition
vi: Thiếu lựa chọn trong định nghĩa XML

source: Option must have text element.
vi: Lựa chọn phải có văn bản.

source: Missing rationale for correct answer.
vi: Thiếu cơ sở lý luận cho câu trả lời đúng.

source: Only one correct answer can be defined in options.
vi: Chỉ có thể chọn một câu trả lời đúng.

source: Seed element must have an option attribute.
vi: Seed element phải có tùy chọn.

source: Every peer instruction tool must contain an "ubcpi" element.
vi: Mỗi công cụ hướng dẫn đồng đẳng phải bao gồm một thành phần "ubcpi".

source: Every peer instruction tool must contain a "display_name" element.
vi: Mỗi công cụ hướng dẫn đồng đẳng phải bao gồm một thành phần "display_name".

source: Every peer instruction must tool contain a "question" element.
vi: Mỗi công cụ hướng dẫn đồng đẳng phải bao gồm một thành phần "question".

source: Every peer instruction must tool contain a "options" element.
vi: Mỗi công cụ hướng dẫn đồng đẳng phải bao gồm một thành phần "options".

source: Every peer instruction must tool contain a "seeds" element.
vi: Mỗi công cụ hướng dẫn đồng đẳng phải bao gồm một thành phần "seeds".

source: Minimum Characters
vi: Số ký tự tối thiểu

source: Maximum Characters
vi: Số ký tự tối đa

source: Number of Responses
vi: Số câu trả lời

source: Not an Integer
vi: Không phải một số nguyên

source: Invalid Option(s):
vi: Lựa chọn không hợp lệ

source: Peer Instruction Question
vi: Câu hỏi Hướng dẫn đồng đẳng

source: <p>Where does most of the mass in a fully grown tree originate?</p>
vi: <p>Hầu hết khối lượng trong một cây phát triển đầy đủ bắt nguồn từ đâu?</p>

source: The question the students see. This question appears above the possible answers which you set below. You can use text, an image or a combination of both. If you wish to add an image to your question, press the 'Add Image' button.
vi: Câu hỏi người học thấy. Câu hỏi này xuất hiện phía trên các câu trả lời mà bạn cài đặt bên dưới. Bạn có thể sử dụng văn bản, hình ảnh hoặc kết hợp cả hai. Nếu bạn muốn thêm hình ảnh vào câu hỏi, nhấn nút 'Thêm hình ảnh'.

source: Air
vi: Không khí

source: Soil
vi: Đất

source: Water
vi: Nước

source: The possible options from which the student may select
vi: Các lựa chọn mà người học có thể chọn

source: The minimum and maximum number of characters a student is allowed for their rationale.
vi: Số ký tự tối thiểu và tối đa cho giải thích của người học.

source: The correct option for the question
vi: Câu trả lời đúng

source: Photosynthesis
vi: Quang hợp

source: The feedback for student for the correct answer
vi: Nhận xét cho người học cho câu trả lời đúng

source: Overall stats for the instructor
vi: Thống kê chung cho người dạy

source: Tree gets carbon from air.
vi: Cây lấy carbon từ không khí.

source: Tree gets minerals from soil.
vi: Cây lấy chất khoáng từ đất

source: Tree drinks water.
vi: Cây hút nước

source: Instructor configured examples to give to students during the revise stage.
vi: Giáo viên cấu hình ví dụ để cung cấp cho sinh viên trong giai đoạn sửa đổi câu trả lời.

source: System selected answers to give to students during the revise stage.
vi: Các câu trả lời được hệ thống chọn để đưa cho người học trong giai đoạn sửa đổi câu trả lời.

source: Stores the specific answers of other students shown, for a given student.
vi: Lưu trữ các câu trả lời cụ thể của các học sinh khác được hiển thị, cho một học sinh nhất định.

source: In case the student requested to see more answers, these are the answers previously shown.
vi: Trường hợp người học yêu cầu xem thêm đáp án thì đây là những đáp án đã thể hiện trước đó.

source: Keep track of the number of refreshes for each option
vi: Theo dõi số lần làm mới cho từng tùy chọn

source: The algorithm for selecting which answers to be presented to students
vi: Thuật toán chọn câu trả lời sẽ được trình bày cho người học

source: ISO-8601 formatted string representing the start date of this assignment. We ignore this.
vi: Chuỗi định dạng ISO-8601 đại diện cho ngày bắt đầu của bài tập này. Chúng ta bỏ qua điều này.

source: ISO-8601 formatted string representing the due date of this assignment. We ignore this.
vi: Chuỗi định dạng ISO-8601 đại diện cho ngày đến hạn của bài tập này. Chúng ta bỏ qua điều này.

source: System will select one of each option to present to the students.
vi: Hệ thống sẽ chọn một trong mỗi tùy chọn để hiển thị cho người học.

source: Completely random selection from the response pool.
vi: Lựa chọn hoàn toàn ngẫu nhiên từ các câu trả lời.

source: Appears above
vi: Xuất hiện bên trên

source: Appears below
vi: Xuất hiện bên dưới
